In [4]:
import pandas as pd
import numpy as np

# Merge multiple dataframes
df1 = pd.DataFrame(np.array([
    ['a', 5, 9],
    ['b', 4, 61],
    ['c', 24, 9]]),
    columns=['name', 'attr11', 'attr12'])
df2 = pd.DataFrame(np.array([
    ['a', 5, 19],
    ['b', 14, 16],
    ['c', 4, 9]]),
    columns=['name', 'attr21', 'attr22'])
df3 = pd.DataFrame(np.array([
    ['a', 15, 49],
    ['b', 4, 36],
    ['c', 14, 9]]),
    columns=['name', 'attr31', 'attr32'])

pd.merge(pd.merge(df1,df2,on='name'),df3,on='name')

  name attr11 attr12 attr21 attr22 attr31 attr32
0    a      5      9      5     19     15     49
1    b      4     61     14     16      4     36
2    c     24      9      4      9     14      9

In [5]:
df1.merge(df2,on='name').merge(df3,on='name')

  name attr11 attr12 attr21 attr22 attr31 attr32
0    a      5      9      5     19     15     49
1    b      4     61     14     16      4     36
2    c     24      9      4      9     14      9